test/fixtures/xml/fedex/request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
        <v13:WebAuthenticationDetail>
           <v13:UserCredential>
              <v13:Key>rscqm75MLampLUuV</v13:Key>
              <v13:Password>8rTZHQ6vbyOsGOgtwMXrZ1kIU</v13:Password>
           </v13:UserCredential>
        </v13:WebAuthenticationDetail>
        <v13:ClientDetail>
           <v13:AccountNumber>510087267</v13:AccountNumber>
           <v13:MeterNumber>118511895</v13:MeterNumber>
        </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>RateRequest_Condor_US_CA_ADG_IE</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:ReturnTransitAndCommit>1</v13:ReturnTransitAndCommit>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2013-08-15T09:30:47-05:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>INTERNATIONAL_ECONOMY</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:Shipper>
               <v13:AccountNumber></v13:AccountNumber>
               <v13:Tins>
                  <v13:TinType>PERSONAL_STATE</v13:TinType>
                  <v13:Number>1057</v13:Number>
                  <v13:Usage>ShipperTinsUsage</v13:Usage>
               </v13:Tins>
               <v13:Contact>
                  <v13:ContactId>SY32030</v13:ContactId>
                  <v13:PersonName>Sunil Yadav</v13:PersonName>
                  <v13:CompanyName>Syntel Inc</v13:CompanyName>
                  <v13:PhoneNumber>9545871684</v13:PhoneNumber>
                  <v13:PhoneExtension>020</v13:PhoneExtension>
                  <v13:EMailAddress>sunil_yadav3@syntelinc.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                  <v13:City>COLORADO SPRINGS</v13:City>
                  <v13:StateOrProvinceCode>CO</v13:StateOrProvinceCode>
                  <v13:PostalCode>80915</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:Contact>
                  <v13:PersonName>Receipient</v13:PersonName>
                  <v13:CompanyName>Receiver Org</v13:CompanyName>
                  <v13:PhoneNumber>9982145555</v13:PhoneNumber>
                  <v13:PhoneExtension>011</v13:PhoneExtension>
                  <v13:EMailAddress>receiver@yahoo.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                  <v13:City>RICHMOND</v13:City>
                  <v13:StateOrProvinceCode>BC</v13:StateOrProvinceCode>
                  <v13:PostalCode>V7C4V4</v13:PostalCode>
                  <v13:UrbanizationCode>BC</v13:UrbanizationCode>
                  <v13:CountryCode>CA</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Recipient>
            <v13:RecipientLocationNumber>DEN001</v13:RecipientLocationNumber>
            <v13:Origin>
               <v13:Contact>
                  <v13:ContactId>SY32030</v13:ContactId>
                  <v13:PersonName>Sunil Yadav</v13:PersonName>
                  <v13:CompanyName>Syntel Inc</v13:CompanyName>
                  <v13:PhoneNumber>9545871684</v13:PhoneNumber>
                  <v13:PhoneExtension>020</v13:PhoneExtension>
                  <v13:EMailAddress>sunil_yadav3@syntelinc.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                  <v13:City>COLORADO SPRINGS</v13:City>
                  <v13:StateOrProvinceCode>CO</v13:StateOrProvinceCode>
                  <v13:PostalCode>80915</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Origin>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber></v13:AccountNumber>
                     <v13:Tins>
                        <v13:TinType>BUSINESS_STATE</v13:TinType>
                        <v13:Number>123456</v13:Number>
                     </v13:Tins>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:DeliveryInstructions>DeliveryInstructions</v13:DeliveryInstructions>
            <v13:CustomsClearanceDetail>
               <v13:ImporterOfRecord>
                  <v13:AccountNumber></v13:AccountNumber>
                  <v13:Tins>
                     <v13:TinType>BUSINESS_NATIONAL</v13:TinType>
                     <v13:Number>0705</v13:Number>
                     <v13:Usage>RecipienttinsUsage</v13:Usage>
                  </v13:Tins>
                  <v13:Contact>
                     <v13:ContactId>SY32030</v13:ContactId>
                     <v13:PersonName>Sunil Yadav</v13:PersonName>
                     <v13:CompanyName>Syntel Inc</v13:CompanyName>
                     <v13:PhoneNumber>9545871684</v13:PhoneNumber>
                     <v13:PhoneExtension>020</v13:PhoneExtension>
                     <v13:EMailAddress>sunil_yadav3@syntelinc.com</v13:EMailAddress>
                  </v13:Contact>
                  <v13:Address>
                     <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                     <v13:City>COLORADO SPRINGS</v13:City>
                     <v13:StateOrProvinceCode>CO</v13:StateOrProvinceCode>
                     <v13:PostalCode>80915</v13:PostalCode>
                     <v13:CountryCode>US</v13:CountryCode>
                     <v13:Residential>0</v13:Residential>
                  </v13:Address>
               </v13:ImporterOfRecord>
               <v13:DutiesPayment>
                  <v13:PaymentType>SENDER</v13:PaymentType>
                  <v13:Payor>
                     <v13:ResponsibleParty>
                        <v13:AccountNumber></v13:AccountNumber>
                        <v13:Tins>
                           <v13:TinType>BUSINESS_STATE</v13:TinType>
                           <v13:Number>123456</v13:Number>
                        </v13:Tins>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:DocumentContent>DOCUMENTS_ONLY</v13:DocumentContent>
               <v13:CustomsValue>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>500.0</v13:Amount>
               </v13:CustomsValue>
               <v13:InsuranceCharges>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>1000.0</v13:Amount>
               </v13:InsuranceCharges>
               <v13:PartiesToTransactionAreRelated>1</v13:PartiesToTransactionAreRelated>
               <v13:CommercialInvoice>
                  <v13:Comments>CommercialInvoiceComments</v13:Comments>
                  <v13:FreightCharge>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>30.0</v13:Amount>
                  </v13:FreightCharge>
                  <v13:TaxesOrMiscellaneousCharge>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:TaxesOrMiscellaneousCharge>
                  <v13:PackingCosts>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>10.0</v13:Amount>
                  </v13:PackingCosts>
                  <v13:HandlingCosts>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>15.0</v13:Amount>
                  </v13:HandlingCosts>
                  <v13:SpecialInstructions>No Special Instructions</v13:SpecialInstructions>
                  <v13:DeclarationStatement>DeclarationStatment</v13:DeclarationStatement>
                  <v13:PaymentTerms>PaymentTerms</v13:PaymentTerms>
                  <v13:Purpose>GIFT</v13:Purpose>
                  <v13:OriginatorName>ROHIT BORSE</v13:OriginatorName>
                  <v13:TermsOfSale>FOB_OR_FCA</v13:TermsOfSale>
               </v13:CommercialInvoice>
               <v13:Commodities>
                  <v13:Name>FLOWER BAGS</v13:Name>
                  <v13:NumberOfPieces>15</v13:NumberOfPieces>
                  <v13:Description>string</v13:Description>
                  <v13:CountryOfManufacture>US</v13:CountryOfManufacture>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>150.0</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>15</v13:Quantity>
                  <v13:QuantityUnits>BAGS</v13:QuantityUnits>
                  <v13:AdditionalMeasures>
                     <v13:Quantity>15</v13:Quantity>
                     <v13:Units>BAGS</v13:Units>
                  </v13:AdditionalMeasures>
                  <v13:UnitPrice>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>35.0</v13:Amount>
                  </v13:UnitPrice>
                  <v13:CustomsValue>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>500.0</v13:Amount>
                  </v13:CustomsValue>
                  <v13:ExciseConditions>
                     <v13:Category>EdtExciseCategory</v13:Category>
                     <v13:Value>EdtExciseValue</v13:Value>
                  </v13:ExciseConditions>
               </v13:Commodities>
               <v13:ExportDetail>
                  <v13:B13AFilingOption>FILED_ELECTRONICALLY</v13:B13AFilingOption>
                  <v13:ExportComplianceStatement>30.37(f)</v13:ExportComplianceStatement>
                  <v13:PermitNumber>PN10570705</v13:PermitNumber>
                  <v13:DestinationControlDetail>
                     <v13:StatementTypes>DEPARTMENT_OF_COMMERCE</v13:StatementTypes>
                     <v13:DestinationCountries>US</v13:DestinationCountries>
                     <v13:EndUser>DEOYANEE BHADANE</v13:EndUser>
                  </v13:DestinationControlDetail>
               </v13:ExportDetail>
               <v13:RegulatoryControls>EU_CIRCULATION</v13:RegulatoryControls>
            </v13:CustomsClearanceDetail>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupNumber>1</v13:GroupNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>150</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>12</v13:Length>
                  <v13:Width>12</v13:Width>
                  <v13:Height>12</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:Dimensions>
               <v13:PhysicalPackaging>BAG</v13:PhysicalPackaging>
               <v13:ItemDescription>TEST ENVIRONMENT - PLEASE DO NOT PROCESS SHIPMENT</v13:ItemDescription>
               <v13:SpecialServicesRequested>
                  <v13:SpecialServiceTypes>DANGEROUS_GOODS</v13:SpecialServiceTypes>
                  <v13:DangerousGoodsDetail>
                     <v13:Accessibility>ACCESSIBLE</v13:Accessibility>
                     <v13:CargoAircraftOnly>0</v13:CargoAircraftOnly>
                     <v13:Options>HAZARDOUS_MATERIALS</v13:Options>
                     <v13:PackingOption>OVERPACK</v13:PackingOption>
                     <v13:Containers>
                        <v13:ContainerType>steel cylinder</v13:ContainerType>
                        <v13:NumberOfContainers>1</v13:NumberOfContainers>
                        <v13:HazardousCommodities>
                           <v13:Description>
                              <v13:Id>1394</v13:Id>
                              <v13:SequenceNumber>1</v13:SequenceNumber>
                              <v13:PackingGroup>II</v13:PackingGroup>
                              <v13:PackingDetails>
                                 <v13:CargoAircraftOnly>0</v13:CargoAircraftOnly>
                                 <v13:PackingInstructions>Y475</v13:PackingInstructions>
                              </v13:PackingDetails>
                              <v13:ProperShippingName>Aluminium carbide</v13:ProperShippingName>
                              <v13:Percentage>2</v13:Percentage>
                              <v13:HazardClass>4.3</v13:HazardClass>
                              <v13:LabelText>Dangerous when wet</v13:LabelText>
                              <v13:ProcessingOptions>INCLUDE_SPECIAL_PROVISIONS</v13:ProcessingOptions>
                           </v13:Description>
                           <v13:Quantity>
                              <v13:Amount>5</v13:Amount>
                              <v13:Units>kg</v13:Units>
                              <v13:QuantityType>NET</v13:QuantityType>
                           </v13:Quantity>
                           <v13:Options>
                              <v13:LabelTextOption>STANDARD</v13:LabelTextOption>
                           </v13:Options>
                        </v13:HazardousCommodities>
                     </v13:Containers>
                     <v13:Packaging>
                        <v13:Count>1</v13:Count>
                        <v13:Units>gal</v13:Units>
                     </v13:Packaging>
                     <v13:Signatory>
                        <v13:ContactName>Pratibha</v13:ContactName>
                        <v13:Title>IATADG</v13:Title>
                        <v13:Place>PUNE</v13:Place>
                     </v13:Signatory>
                     <v13:EmergencyContactNumber>9673496289</v13:EmergencyContactNumber>
                     <v13:Offeror>Pratibha123</v13:Offeror>
                  </v13:DangerousGoodsDetail>
               </v13:SpecialServicesRequested>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>